#+TITLE: Ticket 65
#+AUTHOR: Zach Mandeville


** Curl a sample metadata file
   We'll use the most recent job/bucket from apisnoop, following the spyglass link to get to its artifacts.
   
  #+NAME Curl Sample Metadata
  #+BEGIN_SRC shell
  curl 'https://storage.googleapis.com/kubernetes-jenkins/logs/ci-kubernetes-e2e-gci-gce/1178464478988079104/finished.json'
  #+END_SRC

  #+RESULTS:
  #+begin_EXAMPLE
  {
    "timestamp": 1569805261, 
    "version": "v1.17.0-alpha.0.1912+2b795b9825e485", 
    "result": "SUCCESS", 
    "passed": true, 
    "job-version": "v1.17.0-alpha.0.1912+2b795b9825e485", 
    "metadata": {
      "node_os_image": "cos-73-11647-163-0", 
      "infra-commit": "dba192364", 
      "master_os_image": "cos-73-11647-163-0", 
      "job-version": "v1.17.0-alpha.0.1912+2b795b9825e485", 
      "pod": "f53ddc96-e317-11e9-9585-baa219f9d09d", 
      "revision": "v1.17.0-alpha.0.1912+2b795b9825e485"
    }
  }
  #+end_EXAMPLE
  
  The commit hash is the ~2b795b9825e485~ appended to the version.  We can view the swagger for this commit at this url:
  https://raw.githubusercontent.com/kubernetes/kubernetes/2b795b9825e485/api/openapi-spec/swagger.json
  
  We can load our metadata into our db using the COPY FROM PROGRAM command.  This will just copy over our data as a json blob, so we want to create a temporary table to feed that into, then select from that to generate our actual table.
** Connect to Database
    If you already have your db and hasura endpoint up and running:
 - [ ] Connect to your postgres db from within this file
   You'll want execute this code block by moving your cursor within and typing =,,=
  
   #+NAME: Connect org to postgres
   #+BEGIN_SRC emacs-lisp :results silent
     (sql-connect "apisnoop" (concat "*SQL: postgres:data*"))
   #+END_SRC

 - [ ] Test your connection works
   You can run this sql block, and it see a message in your minbuffer like:
   : You are connected to database "apisnoop" as user "apisnoop" on host "localhost" at port "10041".

   #+NAME: Test Connection
   #+BEGIN_SRC sql-mode :results silent
   \conninfo
   #+END_SRC


#+BEGIN_SRC shell
  IFS="+";\
  version=$(curl https://storage.googleapis.com/kubernetes-jenkins/logs/ci-kubernetes-e2e-gci-gce/1178464478988079104/finished.json | jq .version);\
  commit=${version##*+};\
  commit_hash=${commit%\"*};\
  swagger_link="https://raw.githubusercontent.com/kubernetes/kubernetes/${commit_hash}/api/openapi-spec/swagger.json"
  echo $swagger_link
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
https://raw.githubusercontent.com/kubernetes/kubernetes/2b795b9825e485/api/openapi-spec/swagger.json
#+end_EXAMPLE
